<?php

namespace adxApiV2\config;

class letvConfig {
    public $dspId = 50;
    public $token = "90ce164b5dbb4d94892dbe34200e7b45";//779b9c1c1cab4bbe90693e8ed2e69d37
    public $materialUploadApi = "http://ark.letv.com/api/ad/sync";
    public $materialStatusApi = "http://ark.letv.com/api/ad/getstatus";
    public $errorConfig = array(
        101=>"广告加载失败了，请查看广告url是否正常",
        102=>"您上传的素材格式不符合规范，目前支持jpg,png,swf,flv,mp4,vpaid",
        104=>"上传过程超时了，请从新上传", 
        105=>"请先上传广告主资质", 
        106=>"广告的生效时间为空或者不能解析，请检查你的订单时间",
        107=>"广告的生效时间为空或者不能解析，请检查你的订单时间", 
        108=>"尺寸错误", 
        110=>"广告地址错误",
        111=>"第三方监测地址错误",
        112=>"同步广告物料的ad参数没有填",
        113=>"落地页错误",
        114=>"广告时长解析错误",
        115=>"广告的宽度为必填项且为整数类型值",
        116=>"广告的高度为必填项且为整数类型值",
        117=>"广告url和已经审核通过的广告url重复",
        118=>"素材尺寸有小数",
        119=>"adx平台库没有此广告对应的平台值",
        120=>"广告的媒体属性不正确",
        121=>"广告主不是白名单",
        122=>"广告的行业分类不正确",
        123=>"广告素材类型不正确",
        201=>"素材上传时间不能解析",
        301=>"adurl不能为空",
        302=>"该广告url并未同步到adx中",
        401=>"报表查询的开始时间为空或者不能解析",
        402=>"报表查询的结束时间为空或者不能解析",
        403=>"报表查询时间跨度超过7天",
        404=>"报表查询时的结束时间早于开始时间"
    );
    public $materialStatus = array('待审核' => 0, '通过' => 1, '未通过' => 2);

}

?>